Documents/ВнесениеИзмененийВоВнутреннийПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВнесениеИзмененийВоВнутреннийПеречень</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВнутренниеПеречни</xr:Item>
				<xr:Item>InformationRegister.ОснованияВнесенияВПеречень</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИзмененийПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИнсайдерскойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьЧленаСоветаДиректоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждающиеДокументыКвалифицированногоИнвестора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИсключенияКвалифицированногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НормативныйАкт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыАктивовКвалифицированныхИнвесторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВнесениеИзмененийВоВнутреннийПеречень/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьСотрудника();
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ВидыПеречнейОбъектов = РаботаСМетаданнымиПовтИсп.ЗначенияПредопределенныхЭлементовСправочникаВСтруктуру("ВидыПеречнейОбъектов");
	ВидыИзмененийПеречней = РаботаСМетаданнымиПовтИсп.ЗначенияПеречисленияВСтруктуру("ВидыИзмененийПеречней");
	
	Если Объект.ВидПеречня = ВидыПеречнейОбъектов.ДолжностныеЛицаНАУФОР
	 ИЛИ Объект.ВидПеречня = ВидыПеречнейОбъектов.ДолжностныеЛицаПН Тогда
		Если Объект.ВидИзменения = ВидыИзмененийПеречней.Включение
			ИЛИ Объект.ВидИзменения = ВидыИзмененийПеречней.Изменение Тогда
			
			Если ЭтаФорма.ФлагДолжностноеЛицоЧленСоветаДиректоров = Ложь Тогда
				Объект.ДолжностьЧленаСоветаДиректоров = Неопределено;
			КонецЕсли;
			
			Если ЭтаФорма.ФлагДолжностноеЛицоСотрудник = Ложь Тогда
				Объект.Основания.Очистить();
			КонецЕсли;
			
		Иначе
			ЭтаФорма.ФлагДолжностноеЛицоЧленСоветаДиректоров = Ложь;
			ЭтаФорма.ФлагДолжностноеЛицоСотрудник = Ложь;
			Объект.ДолжностьЧленаСоветаДиректоров = Неопределено;
			Объект.Основания.Очистить();
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы И ТипЗнч(ЭтаФорма.СтруктураПодтверждающихДокументов) = Тип("Структура") Тогда		
		ТекущийОбъект.ПодтверждающиеДокументыКвалифицированногоИнвестора = Новый ХранилищеЗначения(ЭтаФорма.СтруктураПодтверждающихДокументов, Новый СжатиеДанных(9));		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ЗаполнитьДолжностьИПодразделение();
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ВидПеречняПриИзменении(Элемент)
			
	Если НеобходимоОбновитьТабличнуюЧастьВидовАктивов() Тогда
		ОбновитьВидыАктивовНаСервере();
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ОснованияНормативныйАктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ОбластьПрименения, Дата", 
		ПредопределенноеЗначение("Перечисление.ОбластиПримененияНормативныхАктов.ОснованияВключенияВСписокИнсайдеров"), 
		Объект.Дата);
		
	ОткрытьФорму("Справочник.НормативныеАкты.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияКатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ОбластьПрименения, Дата", 
		ПредопределенноеЗначение("Перечисление.ОбластиПримененияНормативныхАктов.КатегорииИнсайдеров"), 
		Объект.Дата);
		
	ОткрытьФорму("Справочник.НормативныеАкты.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Объект.Основания.Количество() Тогда
		ЗаполнитьДолжностьИПодразделение();
	КонецЕсли;
	
	Если НеобходимоОбновитьТабличнуюЧастьВидовАктивов() Тогда
		ОбновитьВидыАктивовНаСервере();
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияНормативныйАктПриИзменении(Элемент)
	
	ТекДанные = Элементы.Основания.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.НормативныйАкт) И Не ЗначениеЗаполнено(ТекДанные.Основание) Тогда
	
		ТекДанные.Основание = ТекДанные.НормативныйАкт;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИзмененияПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФлагДолжностноеЛицоЧленСоветаДиректоровПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагДолжностноеЛицоСотрудникПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОснованияСотрудникПриИзменении(Элемент)
	
	ЗаполнитьДолжностьИПодразделение();
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаПодтверждающиеДокументы(Команда)
	
	Результат = ОткрытьФормуМодально("Документ.ВнесениеИзмененийВоВнутреннийПеречень.Форма.ФормаРедактированияТребований", Новый Структура("Дата, ВидЮрФизЛица, СтруктураПодтверждающихДокументов", Объект.Дата, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Объект, "ВидЮрФизЛица"), СтруктураПодтверждающихДокументов), ЭтаФорма);
	
	// Открыли и закрыли форму, изменения данных нет
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПодтверждающихДокументов = Результат;
	
	ЗаполнитьПодтверждающиеДокументыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ДолжностныеЛица = (Объект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаНАУФОР ИЛИ Объект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаПН);
	
	ЭтаФорма.ФлагДолжностноеЛицоЧленСоветаДиректоров	= (ДолжностныеЛица И ЗначениеЗаполнено(Объект.ДолжностьЧленаСоветаДиректоров));
	ЭтаФорма.ФлагДолжностноеЛицоСотрудник				= (ДолжностныеЛица И Объект.Основания.Количество() > 0);
	
	Если Объект.Основания.Количество() Тогда
		ЗаполнитьДолжностьИПодразделение();
	КонецЕсли;
	
	Если Объект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы Тогда
		ОбъектДокумента = РеквизитФормыВЗначение("Объект");
		ЭтаФорма.СтруктураПодтверждающихДокументов = ОбъектДокумента.ПодтверждающиеДокументыКвалифицированногоИнвестора.Получить();	
	КонецЕсли;
		
	НастроитьВидимостьДоступность(ЭтаФорма);
	
	РаботаСФормами.ЗагрузитьСписокШаблонов(ЭтаФорма, "ОснованияОснование"); 
	
	ЗаполнитьПодтверждающиеДокументыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидыАктивовНаСервере()
	
	Если Не (ЗначениеЗаполнено(Объект.Организация) 
			И ЗначениеЗаполнено(Объект.Объект) 
			И Объект.Дата <> '00010101') Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВидыАктивовКвалифицированныхИнвесторов.Очистить();
		
	// Получаем действующий список активов
	РезультатЗапроса = Документы.ВнесениеИзмененийВоВнутреннийПеречень.РезультатЗапросаПоВидамАктивов(Объект.Организация, Объект.Объект, ?(Объект.Ссылка.Пустая(), Объект.Дата, Объект.Ссылка.МоментВремени()));
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.ВидыАктивовКвалифицированныхИнвесторов.Добавить();
		НоваяСтрока.ВидАктива = Выборка.ВидАктива;
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоФизЛицо(ЮрФизЛицо) 

	ВидЮрФизЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ВидЮрФизЛица");
	Возврат (ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);

КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидыПеречнейОбъектов = РаботаСМетаданнымиПовтИсп.ЗначенияПредопределенныхЭлементовСправочникаВСтруктуру("ВидыПеречнейОбъектов");
	ВидыИзмененийПеречней = РаботаСМетаданнымиПовтИсп.ЗначенияПеречисленияВСтруктуру("ВидыИзмененийПеречней");
	
	ДолжностныеЛица = (Объект.ВидПеречня = ВидыПеречнейОбъектов.ДолжностныеЛицаНАУФОР ИЛИ Объект.ВидПеречня = ВидыПеречнейОбъектов.ДолжностныеЛицаПН);
	
	Элементы.ГруппаФлагиДолжностныеЛица.Видимость		= (ДолжностныеЛица
															И (Объект.ВидИзменения = ВидыИзмененийПеречней.Включение
																ИЛИ Объект.ВидИзменения = ВидыИзмененийПеречней.Изменение));
	
	Элементы.ДолжностьЧленаСоветаДиректоров.Видимость	= Форма.ФлагДолжностноеЛицоЧленСоветаДиректоров;
	Элементы.Основание.Видимость						= Форма.ФлагДолжностноеЛицоЧленСоветаДиректоров;
	
	Элементы.Основания.Видимость = (Объект.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры 
									ИЛИ Объект.ВидПеречня = ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ
									ИЛИ (Элементы.ГруппаФлагиДолжностныеЛица.Видимость И Форма.ФлагДолжностноеЛицоСотрудник));
														
	Элементы.ОбъектИнсайдерскойИнформации.Видимость = (Объект.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры);
	
	Если Элементы.Основания.Видимость Тогда
		Элементы.ОснованияСотрудник.Видимость = (ДолжностныеЛица
													ИЛИ Объект.ВидПеречня = ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ
													ИЛИ (Объект.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры
															И ЗначениеЗаполнено(Объект.Объект) 
															И ЭтоФизЛицо(Объект.Объект)));
															
		Элементы.ГруппаДолжностьИПодразделение.Видимость = Элементы.ОснованияСотрудник.Видимость;
														
		Элементы.ОснованияНормативныйАкт.Видимость	= (Объект.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры 
														И Объект.Дата < Дата(2021,10,1) 
														И ЗначениеЗаполнено(Объект.Дата));
														
		Элементы.ОснованияОснование.Видимость	= (Объект.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры);
		Элементы.ОснованияКатегория.Видимость	= (Объект.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры);
														
	КонецЕсли;
	
	Если Объект.ВидПеречня = ВидыПеречнейОбъектов.Инсайдеры Тогда
		Элементы.Объект.Заголовок = "Инсайдер";
		
	ИначеЕсли Объект.ВидПеречня = ВидыПеречнейОбъектов.ДолжностныеЛицаНАУФОР
	   ИЛИ Объект.ВидПеречня = ВидыПеречнейОбъектов.ДолжностныеЛицаПН Тогда
		Элементы.Объект.Заголовок = "Должностное лицо";
		
	ИначеЕсли Объект.ВидПеречня = ВидыПеречнейОбъектов.СотрудникиОбеспечивающиеДеятельностьУК ИЛИ Объект.ВидПеречня = ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ Тогда
		Элементы.Объект.Заголовок = "Сотрудник";
		
	ИначеЕсли Объект.ВидПеречня = ВидыПеречнейОбъектов.ЛицаОзнакомленныеСКодексами Тогда
		Элементы.Объект.Заголовок = "Физическое лицо";
		
	ИначеЕсли Объект.ВидПеречня = ВидыПеречнейОбъектов.КвалифицированныеИнвесторы Тогда
		Элементы.Объект.Заголовок = "Квалифицированный инвестор";
		
	Иначе
		Элементы.Объект.Заголовок = "Объект";
		
	КонецЕсли;
	
	Форма.ПериодСотрудников = ?(Объект.ВидИзменения = ВидыИзмененийПеречней.Исключение, Объект.Дата - 86400, Объект.Дата);

	Элементы.ВидыАктивовКвалифицированныхИнвесторов.Видимость = Объект.ВидПеречня = ВидыПеречнейОбъектов.КвалифицированныеИнвесторы;
	Элементы.ГруппаПодтверждающиеДокументы.Видимость = Объект.ВидПеречня = ВидыПеречнейОбъектов.КвалифицированныеИнвесторы
									И Объект.ВидИзменения <> ВидыИзмененийПеречней.Исключение;
	Элементы.ПричинаИсключенияКвалифицированногоЛица.Видимость = Объект.ВидПеречня = ВидыПеречнейОбъектов.КвалифицированныеИнвесторы
									И Объект.ВидИзменения <> ВидыИзмененийПеречней.Включение;								
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолжностьИПодразделение()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Сотрудники", Объект.Основания.Выгрузить(, "Сотрудник"));
	Запрос.УстановитьПараметр("Период", 	Объект.Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник,
		|	СотрудникиОрганизацииСрезПоследних.Должность КАК Должность,
		|	СотрудникиОрганизацииСрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Период, Сотрудник В (&Сотрудники)) КАК СотрудникиОрганизацииСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого СтрокаОснования Из Объект.Основания Цикл
			Если Выборка.Сотрудник = СтрокаОснования.Сотрудник Тогда
				СтрокаОснования.Должность		= Выборка.Должность;
				СтрокаОснования.Подразделение	= Выборка.Подразделение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры

Процедура УстановитьДоступностьСотрудника()
	
	//#ТехДолг Добродеев: надо создать общий модуль УправлениеУсловнымОформлением и перенести это всё туда
	КатегорииДляКоторыхУказываетсяСотрудник = Новый Массив;
	КатегорииДляКоторыхУказываетсяСотрудник.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Пункт13статьи4Закона224"));
	КатегорииДляКоторыхУказываетсяСотрудник.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("пункт7статьи4Закона224"));
	
#Область Недоступность

	ЭлементФормления = УсловноеОформление.Элементы.Добавить();
	ЭлементФормления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементФормления.Использование = Истина;
	
	Для Каждого КатегорияДляКоторойУказываетсяСотрудник Из КатегорииДляКоторыхУказываетсяСотрудник Цикл
		
		ЭлементОтбора = ЭлементФормления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.Основания.Категория");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение	= КатегорияДляКоторойУказываетсяСотрудник;
		ЭлементОтбора.Использование		= Истина;
		
	КонецЦикла; 
	
	ЭлементОтбора = ЭлементФормления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.ВидПеречня");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= Справочники.ВидыПеречнейОбъектов.Инсайдеры;
	ЭлементОтбора.Использование		= Истина;
	
	ПолеФормления = ЭлементФормления.Поля.Элементы.Добавить();
	ПолеФормления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОснованияСотрудник.Имя);
	ПолеФормления.Использование = Истина;
	
#КонецОбласти
	
#Область Доступность

	ЭлементФормления = УсловноеОформление.Элементы.Добавить();
	ЭлементФормления.Оформление.УстановитьЗначениеПараметра("Доступность", Истина);
	ЭлементФормления.Использование = Истина;
	
	ГруппаКатегория = ЭлементФормления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаКатегория.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Для Каждого КатегорияДляКоторойУказываетсяСотрудник Из КатегорииДляКоторыхУказываетсяСотрудник Цикл
		
		ЭлементОтбора = ГруппаКатегория.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.Основания.Категория");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение	= КатегорияДляКоторойУказываетсяСотрудник;
		ЭлементОтбора.Использование		= Истина;
		
	КонецЦикла;
		
	ЭлементОтбора = ЭлементФормления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.ВидПеречня");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= Справочники.ВидыПеречнейОбъектов.Инсайдеры;
	ЭлементОтбора.Использование		= Истина;
	
	ПолеФормления = ЭлементФормления.Поля.Элементы.Добавить();
	ПолеФормления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОснованияСотрудник.Имя);
	ПолеФормления.Использование = Истина;
	
#КонецОбласти	

#Область ЦветИНадпись

	ЭлементФормления = УсловноеОформление.Элементы.Добавить();
	ЭлементФормления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(169,169,169));
	ЭлементФормления.Оформление.УстановитьЗначениеПараметра("Текст", "Сотрудник указывается только для категорий " + СтрСоединить(КатегорииДляКоторыхУказываетсяСотрудник, ", "));
	ЭлементФормления.Использование = Истина;
	
	Для Каждого КатегорияДляКоторойУказываетсяСотрудник Из КатегорииДляКоторыхУказываетсяСотрудник Цикл
		
		ЭлементОтбора = ЭлементФормления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.Основания.Категория");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение	= КатегорияДляКоторойУказываетсяСотрудник;
		ЭлементОтбора.Использование		= Истина;
		
	КонецЦикла;
	
	ЭлементОтбора = ЭлементФормления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Объект.ВидПеречня");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= Справочники.ВидыПеречнейОбъектов.Инсайдеры;
	ЭлементОтбора.Использование		= Истина;
	
	ПолеФормления = ЭлементФормления.Поля.Элементы.Добавить();
	ПолеФормления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОснованияСотрудник.Имя);
	ПолеФормления.Использование = Истина;
	
#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждающиеДокументыНаСервере()
	
	Если СтруктураПодтверждающихДокументов = Неопределено Тогда 
		ЭтаФорма.ПодтверждающиеДокументы = "";
		Возврат;
	КонецЕсли;
			
	Результат = "";
	Для Каждого КлючИЗначение Из СтруктураПодтверждающихДокументов Цикл
		Результат = ?(ПустаяСтрока(Результат), "", Результат + "; ") + КлючИЗначение.Значение;
	КонецЦикла;
	
	ЭтаФорма.ПодтверждающиеДокументы = Результат;
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимоОбновитьТабличнуюЧастьВидовАктивов()
	
	Если Объект.ВидПеречня <> ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы") Тогда		
		Возврат Ложь;		
	ИначеЕсли Объект.ВидыАктивовКвалифицированныхИнвесторов.Количество() = 0 Тогда
		Возврат Истина;
	ИначеЕсли Объект.ВидИзменения = ПредопределенноеЗначение("Перечисление.ВидыИзмененийПеречней.Включение") Тогда
		Возврат Ложь;	
	КонецЕсли;		
		
	Возврат Вопрос("Обновить таблицу видов активов по текущим параметрам?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти 

#Область Работа_с_шаблонами

&НаКлиенте
Процедура КомандаНастройкаШаблонов_Подключаемый(Команда)
	
	ИмяЭлемента	= СтрРазделить(Команда.Имя, "_")[1];
	Результат	= ОткрытьФормуМодально("ОбщаяФорма.ФормаСпискаШаблонов", Новый Структура("СписокШаблонов", ЭтаФорма["СписокШаблонов_" + ИмяЭлемента])); 
	
	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		СохранитьСписокШаблоновНаСервере(Результат, ИмяЭлемента);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере 
Процедура СохранитьСписокШаблоновНаСервере(СписокШаблонов, ИмяЭлемента)

	РаботаСФормами.СохранитьСписокШаблонов(ЭтаФорма, ИмяЭлемента, СписокШаблонов);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореШаблона_Подключаемый(Команда)
	
	РаботаСФормамиКлиент.ПриВыбореШаблона(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
